<?php
$lang['reminder message'] ="क्योंकि आपकी पंजीकरण जानकारी और आपके भुगतान बैंक खाते की जानकारी असंगत है, कृपया प्रमाणीकरण पूरा करने के लिए तुरंत हमारे ग्राहक सेवा कर्मचारियों से संपर्क करें। आपकी वित्तीय सुरक्षा सुनिश्चित करने के लिए, आपके खाते के कार्य का हिस्सा सीमित होने से पहले कृपया समझें।";
$lang['not_allowed_kyc_risk_score_message'] ='क्योंकि आपकी पंजीकरण जानकारी और आपके भुगतान बैंक खाते की जानकारी असंगत है, कृपया प्रमाणीकरण पूरा करने के लिए तुरंत हमारे ग्राहक सेवा कर्मचारियों से संपर्क करें। आपकी वित्तीय सुरक्षा सुनिश्चित करने के लिए, आपके खाते के कार्य का हिस्सा सीमित होने से पहले कृपया समझें।';
$lang['promo.dont_allow_not_within_claim_time'] ="इस बार प्रमोशन नहीं मिल रहा है";
$lang['Unable to apply promo due to withdrawal condition not yet completed.'] = 'निकासी की शर्त अभी तक पूरी नहीं होने के कारण प्रोमो लागू करने में असमर्थ';
$lang['Your affiliate is not valid in this promo'] = "इस प्रोमो में आपका सहयोगी मान्य नहीं है";
$lang['player.failed.login.attempt.forever'] ="आपका खाता अस्थायी रूप से निरस्त किया गया क्यू, आप लॉगिन करने में विफल हो गये, कृपया ग्राहक सेवा केंद्र से संपर्क करें";
$lang['Reached today approved limit'] = "आज स्वीकृत सीमा तक पहुंच गया";
