<?php

$lang['header.home']    = 'ទំព័រដើម';
$lang['Sports']         = 'ភ្នាល់កីឡា';
$lang['Live Casino']    = 'កាស៊ីណូអនឡាញ';
$lang['Slots']          = 'ស្លុត';
$lang['header.fishing'] = 'ហ្គេមបាញ់ត្រី';
$lang['keno_lotto']     = 'ឡូតូ';
$lang['Promotions']     = 'ប្រូម៉ូសិន';
$lang['VIP']            = 'វីអាយភី';
$lang['Blog']           = 'BLOG';

$lang['footer.additional']				= 'ការណែនាំបន្ថែម';
$lang['footer.about_us.title']			= 'អំពីយើងខ្ញុំ';
$lang['footer.about_us.contents']		= 'SCS188 ជាវេបសាយហ្គេមភ្នាល់អនឡាញដែលបានទទួលស្គាល់ជុំវិញពិភពលោក សម្រាប់ទម្រង់ហ្គេមកាស៊ីណូអនឡានឈានមុខដែលមានឈ្មោះល្បីក្នុងការផលិតហ្គេមដែលបានទទួលការនិយមពីអ្នកផ្តល់សេវាកម្មដល់អ្នកលេងដែលមានចំណាប់អារម្មណ៍ ដោយទម្រង់ច្បាប់ហ្គេមរបស់យើងត្រូវបានបង្កើតឡើងនៅក្រោមការគ្រប់គ្រងរបស់រាជរដ្ឋាភិបាលភីលីហ្វីន ដែលជាកន្លែងដែលអ្នករកស៊ីវេបសាយភ្នាល់របស់អាស៊ានបានល្បីល្បាញក្នុងការទទួកបានរង្វាន់យ៉ាងសុះសាយក្នុងភូមិភាគនេះ ។';
$lang['footer.why_choose.title']		= 'ហេតុអ្វីត្រូវជ្រើសរើសលេង SCS188';
$lang['footer.why_choose.contents']		= 'ដោយសារតែយើងបានរួបរួមហ្គេមកាស៊ីណូអនឡាញពីទម្រង់ហ្គេមដែលធានាបានក្នុងការប្រើប្រាស់លើទូរស័ព្ទដៃដែលទាន់ម័យបំផុត ជាមួយប្រព័ន្ធស្វ័យប្រវត្តិក្នុងការរៀបចំគណនីហ្គេមក្នុងកាបូបលុយរបស់លោកអ្នក​ ហើយយើងត្រូវការជាវេបសាយហ្គេមភ្នាល់អនឡាញដែលបង្កើតការជឿជាក់ទៅដល់អ្នកលេងសូម្បីតែការពេញចិត្តក្នុងទម្រង់នៃការប្រើប្រាស់ យើងក៏ត្រូវការទទួលរង្វាន់ការពេញចិត្តរបស់អតិថិជនដើម្បីជាវេបសាយភ្នាល់ដ៏ល្អបំផុត ។';
$lang['footer.member_and_aff.title']		= 'ការក្លាយជាសមាជិក និងដៃគូ';
$lang['footer.member_and_aff.contents']		= 'ចូលរួមជាផ្នែកមួយជាមួយវេបសាយភ្នាល់កាស៊ីណូនិងចាក់បាល់អនឡាញរបស់យើង សម្រាប់អតិថិជននិងដៃគូដែលត្រូវការធ្វើជាភ្នាក់ងារ លោកអ្នកនិងបានទទួលកម្រៃជើងសារពិសេសក្នុងការក្លាយជាសមាជិក VIP ជាច្រើនលំដាប់ ហើយសេវាកម្មឧបត្ថម្ភអ្នកលេងជាពិសេស ក្រៅពីនេះយើងនៅមានប្រព័ន្ធចុះឈ្មោះហ្គេមនិងការដាក់-ដកប្រាក់ដោយប្រព័ន្ធស្វ័យប្រវត្តិ សម្រាប់អោយសមាជិកចូលប្រើប្រាស់បានភ្លាមៗ ។';
$lang['footer.online_betting.title']	= 'សេវាកម្មហ្គេមភ្នាល់អនឡាញ';
$lang['footer.online_betting.contents']	= 'យើងជាវេបសាយភ្នាល់អនឡាញដែលបានបើកក្នុងទម្រង់ដែលទាន់សម័យរហ័សក្នុងការផ្តល់សេវាកម្មនិងចែករំលែកការជឿជាក់ដល់អតិថិជនដោយហិរញ្ញវត្ថុដែលមានស្ថេរភាព ជាមួយសេវាកម្មដែលមានស្តង់ដារពីបុគ្គលិកដែលបម្រើសេវាកម្មអតិថិជនពេញ 24 ម៉ោងតែរាប់ថាមិនទាន់គ្រប់គ្រាន់ក្នុងការបង្កើតការកម្សាន្តនិងហ្គេមផ្សងសំណាងដែលប្លែកថ្មីដល់អ្នកលេង ដោយសេវាកម្មហ្គេមកាស៊ីណូភ្នាល់អនឡាញ ស្លុតអនឡាញ ហ្គេមបាញ់ត្រី ភ្នាល់កីឡាអនឡាញ ចាក់បាល់និងឆ្នោត ដោយលក្ខណៈពិសេសរបស់អ្នកផលិតហ្គេមជាច្រើនបានទៅលើ Dream Gaming, Asia Gaming, BBIN, Oriental Gaming, Micro Gaming, Ebet, SA Gaming, Deluxe Gold, Sun City, Evolution Gaming និង Playtech ជាដើម ។';
$lang['footer.suggestion.title']		= 'ការផ្តល់យោបល់';
$lang['footer.suggestion.contents']		= 'SCS188 មានជម្រើសក្នុងការក្លាយជាសមាជិកដែលអ្នកលេងនិងបានទទួលលទ្ធផលតបស្នងដ៏ពេញចិត្តនិងឳកាសក្នុងការឈ្នះប្រាក់រង្វាន់ខ្ពស់ សម្រាប់ការបន្ថែមជូនពិសេសពីប្រូម៉ូសិនដែលលោកអ្នកជ្រើសរើសបានតាមសេចក្តីត្រូវការ​ ហើយសម្រាប់ការក្លាយជាសម្ព័ន្ធមិត្តលោកអ្នកនិងបានទទួលលទ្ធផលតបស្នងដ៏ពេញចិត្តក្នុងការទទួលបានកម្រៃជើងសារក្នុងការជ្រើសរើសហ្គេមជាច្រើនក្នុងការដាក់ភ្នាល់របស់អ្នកលេងដែលមិនជាន់គ្នាក្នុងវេបសាយតែមួយ អ្នកលេងនិងបានចូលរួមរីករាយជាមួយអ្នកផ្តល់សេវាកម្មហ្គេមកាស៊ីណូអនឡាញឈានមុខ សម្រាប់ច្បាប់ហ្គេមកាស៊ីណូអនឡាញដែលពិភពលោកទទួលស្គាល់ ។';
$lang['footer.aff.title']				= 'ដៃគូq';
$lang['footer.aff.contents']			= 'ផលប្រយោជន៍ក្នុងការក្លាយជាដៃគូរជាមួយយើងខ្ញុំមានសារៈសំខាន់ក្នុងការទទួលកម្រៃជើងសារខ្ពស់បំផុតនិងជាជំនួយសម្រាប់ដៃគូរ រឺ សម្ព័ន្ធមិត្តដែលត្រូវការរកចំនូលបន្ថែមជាមួយវេបសាយភ្នាល់អនឡាញ SCS188 របស់យើងខ្ញុំុ ដែលមានសេវាកម្មហ្គេមកាស៊ីណូអនឡាញដែលមានគ្រប់គ្រាន់ផ្តល់អោយអតិថិជនគ្រប់ក្រុម មិនថាជាផ្សព្វផ្សាយ ទីផ្សាររបស់ហ្គេមដែលនិយមនាពេលបច្ចុប្បន្ន និងទម្រង់ក្នុងការរៀបចំសមាជិក យើងនិងជួយអោយលោកអ្នកដំណើរការអាជីវកម្មបានសម្រេចតាមគោលដៅ ។';

$lang['footer.game_providers']			= 'អ្នកផ្តល់សេវាកម្មហ្គេម';
$lang['footer.money_deposit_channel']	= 'ជម្រើសក្នុងការដាក់ទឹកប្រាក់';
$lang['footer.monitor_control_by']		= 'គ្រប់គ្រងដោយ';
$lang['footer.contact_us']				= 'ទំនាក់ទំនងយើងខ្ញុំ';
$lang['footer.transfer_through']		= 'ផ្ទេរតាមរយៈ';
$lang['footer.local_bank']				= 'ធនាគារក្នុងប្រទេស';
$lang['footer.call_us']					= 'ទូរស័ព្ទមកកាន់យើងខ្ញុំ';
$lang['footer.line']					= 'LINE';
$lang['footer.live_chat']				= 'ជជែកកំសាន្តផ្ទាល់';
$lang['footer.click_here']				= 'ចុចទីនេះ';
$lang['footer.about_us']				= 'អំពីយើងខ្ញុំ';
$lang['footer.faq']						= 'សំនួរដែលជួបញឹកញាប់';
$lang['footer.responsibility']			= 'ទំនួលខុសត្រូវក្នុងការដាក់ភ្នាល់';
$lang['footer.terms_conds']				= 'លក្ខខណ្ឌ និងកិច្ចព្រមព្រៀង';
$lang['footer.privacy_policy']			= 'គោលនយោបាយភាពជាឯកជន';
$lang['footer.security']				= 'សុវត្ថិភាព';

$lang['header.1.home']			= 'ទំព័រដើម';
$lang['header.1.sports']			= 'ភ្នាល់កីឡា';
$lang['header.1.live_casino']		= 'កាស៊ីណូអនឡាញ';
$lang['header.1.slots']			= 'ស្លុត';
$lang['header.1.fishing']			= 'ហ្គេមបាញ់ត្រី';
$lang['header.1.keno_lotto']		= 'ឡូតូ';
$lang['header.1.promotions']		= 'ប្រូម៉ូសិន';
$lang['header.1.vip']				= 'វីអាយភី';
$lang['header.1.blog']			= 'BLOG';
$lang['header.1.virtual_sports']		= 'กีฬาจำลอง';

